LaoGuoChen/F1-Architecture-Master/source/priph_cfg/src/stm32f10x_tim_config.c
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_0);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_1);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_2;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_2);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_3);	  
            }							
        }  
            break;
        case 0x21:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM2, ENABLE);
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_15;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_15);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_3);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_2;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_2);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_3);	  
            }
        }
            break;
        case 0x22:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            GPIO_PinRemapConfig(GPIO_PartialRemap2_TIM2, ENABLE);
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_0);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_1);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_10;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_10);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_11;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_11);	  
            }
        }
            break;
        case 0x23:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            GPIO_PinRemapConfig(GPIO_FullRemap_TIM2, ENABLE);
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_15;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_15);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_3;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_3);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_10;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_10);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_11;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_11);	  
            }
        }
            break;
        case 0x30:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOA, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOA, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_0);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_1);	  
            }
        }
            break;
        case 0x31:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            GPIO_PinRemapConfig(GPIO_PartialRemap_TIM3, ENABLE);
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_4;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_4);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_5;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_5);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_0;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_0);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_1);	  
            }
        }
            break;
        case 0x32:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);  ///<使能GPIOD时钟
            GPIO_PinRemapConfig(GPIO_FullRemap_TIM3, ENABLE);
            
