LaoGuoChen/F1-Architecture-Master/source/priph_cfg/src/stm32f10x_tim_config.c
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_8);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_9);	  
            }
        }
            break;
        case 0x40:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_8);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOB, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOB, GPIO_Pin_9);	  
            }
        }
            break;
        case 0x41:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);  ///<使能GPIOD时钟
            GPIO_PinRemapConfig(GPIO_Remap_TIM4, ENABLE);
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_12;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOD, GPIO_Pin_12);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_13;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOD, GPIO_Pin_13);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_14;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOD, GPIO_Pin_14);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_15;            
                GPIO_Init(GPIOD, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOD, GPIO_Pin_15);	  
            }
        }
            break;
        case 0x80:
        {
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);  ///<使能GPIOD时钟
            
            if (channel & 0x01)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_6;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_6);	  
            }
            if (channel & 0x02)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_7;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_7);	  
            }	
            if (channel & 0x04)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_8;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_8);	  
            }	 
            if (channel & 0x08)
            {
                GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_9;            
                GPIO_Init(GPIOC, &GPIO_InitStructure);
                GPIO_ResetBits(GPIOC, GPIO_Pin_9);	  
            }
        }
            break;
        default:
            break;
    }
}
/**
  * @brief  根据定时器编号初始化对应参数
  * @param  tim_id:定时器的编号
  * @param  TIM_TimeBaseStructure:定时器的参数
  * @retval None
  */
static void InitTimeBase(const u8 tim_id, TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure)
{
    switch (tim_id)
    {
        case 1:
            TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break;
        case 2:
            TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        case 3:
            TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break;
        case 4:
            TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        case 8:
            TIM_TimeBaseInit(TIM8, &TIM_TimeBaseStructure); ///<根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
            break; 
        default:
            break;
    }

}
/**
  * @brief  初始化定时器输入捕获操作
  * @param  tim_id:定时器的编号
  * @param  channel:通道数和，后四位每位的高低状态表示CH1-4的选择状态。如0x06表示选择了CH2和CH4.
  * @param  remap_par:重映射参数
  *         -0:无重映射
  *         -1:该串口有部分重映射则部分重映射，无则全重映射  
  *         -2:全重映射  
  * @param  arr:重载计数
  * @param  psc:预分频系数
  * @retval None
  */
void InitTimToCap(const u8 tim_id, const u8 channel, const u8 remap, const u16 arr, const u16 psc)
{	 
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    TIM_ICInitTypeDef  TIM_ICInitStructure;
    u8 channel_index = 0;
    static u8 sub_priority = 0;
    
