LaoGuoChen/F1-Architecture-Master/source/priph_cfg/src/stm32f10x_tim_config.c
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_AFIO, ENABLE);  ///<使能GPIO外设和AFIO复用功能模块时钟使能

    EnableTimRccClock(tim_id);
    
    ConfigTimGpio(0, tim_id, channel, remap);
     
    TIM_TimeBaseStructure.TIM_Period = arr; ///<设定计数器自动重装值 
    TIM_TimeBaseStructure.TIM_Prescaler = psc; 	///<预分频器   
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1; ///<设置时钟分割:TDTS = Tck_tim
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  ///<TIM向上计数模式

    InitTimeBase(tim_id, TIM_TimeBaseStructure);
    
    TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;	///<上升沿捕获
    TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI; ///<映射到TI1上
    TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;	 ///<配置输入分频,不分频 
    TIM_ICInitStructure.TIM_ICFilter = 0x00;///<IC1F=0000 配置输入滤波器 不滤波
        
    for (channel_index = 0; channel_index < 4; channel_index++)
    {
        if (!((channel >> channel_index) & 0x01))
        {
            continue;
        }
        
        if (channel_index == 0)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_1; 
        }
        else if (channel_index == 1)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;   
        }
        else if (channel_index == 2)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_3;
        }
        else if (channel_index == 3)
        {
            TIM_ICInitStructure.TIM_Channel = TIM_Channel_4; 
        }
        switch (tim_id)
        {
            case 1:
                TIM_ICInit(TIM1, &TIM_ICInitStructure);    
                break;
            case 2:
                TIM_ICInit(TIM2, &TIM_ICInitStructure);    
                break; 
            case 3:
                TIM_ICInit(TIM3, &TIM_ICInitStructure);  
                break;
            case 4:
                TIM_ICInit(TIM4, &TIM_ICInitStructure);  
                break; 
            case 8:
                TIM_ICInit(TIM8, &TIM_ICInitStructure);  
                break; 
            default:
                break;
        }
    }
    
    ///<中断分组初始化
    switch (tim_id)
    {
        case 1:
            NVIC_InitStructure.NVIC_IRQChannel = TIM1_CC_IRQn;   
            break;
        case 2:
            NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn; 
            break; 
        case 3:
            NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn; 
            break;
        case 4:
            NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;  
            break; 
        case 8:
            NVIC_InitStructure.NVIC_IRQChannel = TIM8_UP_IRQn; 
            break; 
        default:
            break;
    }
    
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;  
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = sub_priority++; 
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
    NVIC_Init(&NVIC_InitStructure);  
    
    switch (tim_id)
    {
        case 1:
            TIM_ITConfig(TIM1, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM1, ENABLE ); 	
            break;
        case 2:
            TIM_ITConfig(TIM2, TIM_IT_Update | (channel << 1), ENABLE);// TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | 
            TIM_Cmd(TIM2, ENABLE ); 
            break; 
        case 3:
            TIM_ITConfig(TIM3, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM3, ENABLE ); 
            break;
        case 4:
            TIM_ITConfig(TIM4, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM4, ENABLE );   
            break; 
        case 8:
            TIM_ITConfig(TIM8, TIM_IT_Update | TIM_IT_CC1 | TIM_IT_CC2 | TIM_IT_CC3 | TIM_IT_CC4, ENABLE);
            TIM_Cmd(TIM8, ENABLE ); 
            break; 
        default:
            break;
    }
}
/**
  * @brief  初始化定时器PWM操作
  * @param  tim_id:定时器的编号
  * @param  channel:通道数和，后四位每位的高低状态表示CH1-4的选择状态。如0x06表示选择了CH2和CH4.
  * @param  remap_par:重映射参数
  *         -0:无重映射
  *         -1:该串口有部分重映射则部分重映射，无则全重映射  
  *         -2:全重映射  
  * @param  arr:重载计数
  * @param  psc:预分频系数
  * @retval None
  */
void InitTimToPwm(const u8 tim_id, const u8 channel, const u8 remap, const u16 arr, const u16 psc)
{

	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	TIM_OCInitTypeDef  TIM_OCInitStructure;
    u8 channel_index = 0;
    u8 tim_id_channel = 0;

    RCC_APB2PeriphClockCmd( RCC_APB2Periph_AFIO, ENABLE);  ///<使能GPIO外设和AFIO复用功能模块时钟使能

    EnableTimRccClock(tim_id);
	
    ConfigTimGpio(1, tim_id, channel, remap);
    
	TIM_TimeBaseStructure.TIM_Period = arr; ///<设置自动重装载周期值
	TIM_TimeBaseStructure.TIM_Prescaler = psc; ///<设置预分频值 不分频
	TIM_TimeBaseStructure.TIM_ClockDivision = 0; ///<设置时钟分割:TDTS = Tck_tim
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  ///<TIM向上计数模式
	InitTimeBase(tim_id, TIM_TimeBaseStructure);	
	 
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2; ///<CH1 PWM2模式	
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; ///<比较输出使能
	TIM_OCInitStructure.TIM_Pulse = 0; ///<设置待装入捕获比较寄存器的脉冲值
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; ///<OC1 低电平有效 

	
    for (channel_index = 0; channel_index < 4; channel_index++)
    {
        if(!((channel >> channel_index) & 0x01))
        {
            continue;
        }
        
        tim_id_channel = (((tim_id & 0x0f) << 4) | (channel_index & 0x0f));

        switch (tim_id_channel)
        {
            case 0x10:
            {
                TIM_OC1Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x11:
            {
                TIM_OC2Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x12:
            {
                TIM_OC3Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x13:
            {
                TIM_OC4Init(TIM1, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM1, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break;
            case 0x20:
            {
                TIM_OC1Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x21:
            {
                TIM_OC2Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x22:
            {
                TIM_OC3Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x23:
            {
                TIM_OC4Init(TIM2, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM2, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break;   
            case 0x30:
            {
                TIM_OC1Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x31:
            {
                TIM_OC2Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x32:
            {
                TIM_OC3Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x33:
            {
                TIM_OC4Init(TIM3, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM3, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break;
            case 0x40:
            {
                TIM_OC1Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x41:
            {
                TIM_OC2Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x42:
            {
                TIM_OC3Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x43:
            {
                TIM_OC4Init(TIM4, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break; 
            case 0x80:
            {
                TIM_OC1Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC1PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH1 预装载使能
            }
                break;
            case 0x81:
            {
                TIM_OC2Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC2PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH2 预装载使能
            }
                break;
            case 0x82:
            {
                TIM_OC3Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC3PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH3 预装载使能
            }
                break;
            case 0x83:
            {
                TIM_OC4Init(TIM8, &TIM_OCInitStructure);  ///<根据指定的参数初始化外设TIMx
                TIM_OC4PreloadConfig(TIM8, TIM_OCPreload_Enable);  ///<CH4 预装载使能
            }
                break; 
        }
    }
    switch (tim_id)
    {
        case 1:
        {
            TIM_ARRPreloadConfig(TIM1, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM1, ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM1, ENABLE);  ///<使能TIMx        
        }
            break;
        case 2:
        {
            TIM_ARRPreloadConfig(TIM2, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM2,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM2, ENABLE);  ///<使能TIMx        
        }
            break;
        case 3:
        {
            TIM_ARRPreloadConfig(TIM3, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM3,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM3, ENABLE);  ///<使能TIMx        
        }
            break;
        case 4:
        {
            TIM_ARRPreloadConfig(TIM4, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM4,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM4, ENABLE);  ///<使能TIMx        
        }
            break;
        case 8:
        {
            TIM_ARRPreloadConfig(TIM8, ENABLE); ///<使能TIMx在ARR上的预装载寄存器
            TIM_CtrlPWMOutputs(TIM8,ENABLE);	///<MOE 主输出使能,高级定时器必须开启这个 
            TIM_Cmd(TIM8, ENABLE);  ///<使能TIMx        
        }
            break;
        default:
            break;
        
    }

}
/************************* (C) COPYRIGHT 2018 HWJ *********END OF FILE*********/
